Autodesk.Revit.UI.UIDocument.#ctor(Autodesk.Revit.DB.Document)
Use a database level Document to construct a UI-level Document.

Autodesk.Revit.UI.UIDocument.PromptForFamilyInstancePlacement(Autodesk.Revit.DB.FamilySymbol)
Prompts the user to place instances of the specified FamilySymbol.
familySymbol: The FamilySymbol.
Remarks:  This method opens its own transaction, so it's not permitted to be invoked in an active transaction.
In a single invocation, the user can place multiple instances of the input family type until they finish the
placement (with Cancel or ESC or a click elsewhere in the UI). The user will not be permitted to change the type to be placed.
Users are not permitted to change the active view during this placement operation (the operation will be completed).
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when
this API method is invoked in an active transaction,
or this document is not active,
or this is a family document and the instances of this family symbol can not exist in the current family,
or this family symbol has no command to create instance,
or the command to create instance is disabled in active view.
Since: 2011

Autodesk.Revit.UI.UIDocument.ActiveView
The currently active view of the currently active document.
Since: 2012
Remarks:
This property is applicable to the currently active document only.
The active view can only be changed when:
There is no open transaction.Autodesk.Revit.DB.Document.IsModifiable is false.Autodesk.Revit.DB.Document.IsReadOnly is false.ViewActivating, ViewActivated, and any pre-action of events (such as DocumentSaving or DocumentClosingevents) are not being handled.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting the property: If the 'view' argument is NULL.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting the property:
If the given view is not a valid view of the document; -or-If the given view is a template view; -or-If the given view is an internal view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When getting the property: If the document is not currently active.
When setting the property:
If the document is not currently active; -or-If the document is currently modifiable (i.e. with an active transaction); -or-If the document is currently in read-only state; -or-When invoked during either ViewActivating or ViewActivated event; -or-When invoked during any pre-action kind of event, such as DocumentSaving, DocumentClosing, etc.

Autodesk.Revit.UI.UIDocument.SaveAs
Saves the document to a file name obtained from the Revit user.
Remarks: Because the argument list is null, a SaveAs dialog will be shown to query the file name.
This method may not be called unless all transactions, sub-transactions, and transaction groups that were opened by the API code were closed.
That also implies that this method cannot be called during dynamic updates.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if there are any transactions, sub-transactions or transaction groups which
were opened by the API code, and not closed. All of these items must be handled
before attempting to close the document.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Thrown if saving as is cancelled by an external application during 'DocumentSavingAs' event.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown if this a linked file.